-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: disaster_data
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `earthquake_disasterinfo`
--

DROP TABLE IF EXISTS `earthquake_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `earthquake_disasterinfo` (
  `earthquakeId` varchar(45) NOT NULL,
  `province` varchar(45) DEFAULT NULL,
  `city` varchar(45) DEFAULT NULL,
  `country` varchar(45) DEFAULT NULL,
  `town` varchar(45) DEFAULT NULL,
  `village` varchar(45) DEFAULT NULL,
  `catagory` varchar(45) DEFAULT NULL,
  `date` datetime DEFAULT NULL,
  `location` varchar(45) DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  `latitude` double DEFAULT NULL,
  `depth` int DEFAULT NULL,
  `magnitude` double DEFAULT NULL,
  `reportingUnit` varchar(20) DEFAULT NULL,
  `picture` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`earthquakeId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `earthquake_disasterinfo`
--

LOCK TABLES `earthquake_disasterinfo` WRITE;
/*!40000 ALTER TABLE `earthquake_disasterinfo` DISABLE KEYS */;
INSERT INTO `earthquake_disasterinfo` VALUES ('11010100100120210421101657','北京市','市辖区','东城区','东华门街道','多福巷社区居委会','基本震情','2021-04-21 10:16:57','北京东城区',116.63,40.16,10,2.3,'北京地震局','bj1.jpg'),('11010100100120210421111750','北京市','市辖区','东城区','东华门街道','多福巷社区居委会','基本震情','2021-04-21 11:17:50','北京东城区',116.63,40.16,12,5.3,'北京地震局','bj2.jpg'),('11010100100120210421111952','北京市','市辖区','东城区','东华门街道','多福巷社区居委会','基本震情','2021-04-21 11:19:52','北京东城区',116.63,40.16,15,7.3,'北京地震局','bj3.jpg'),('14040300200120210421211600','山西省','长治市','城区','西街街道办事处','参府社区居委会','基本震情','2021-04-21 21:16:00','山西省长治市城区',113.01,35.5,15,2.5,'山西地震局','sx1.jpg'),('14040300200120210422191700','山西省','长治市','城区','西街街道办事处','参府社区居委会','基本震情','2021-04-22 19:17:00','山西省长治市城区',113.01,35.5,15,2.7,'山西地震局','sx2.jpg');
/*!40000 ALTER TABLE `earthquake_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `house_disasterinfo`
--

DROP TABLE IF EXISTS `house_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `house_disasterinfo` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `province` varchar(45) DEFAULT NULL,
  `city` varchar(45) DEFAULT NULL,
  `country` varchar(45) DEFAULT NULL,
  `town` varchar(45) DEFAULT NULL,
  `village` varchar(45) DEFAULT NULL,
  `catagory` varchar(45) DEFAULT NULL,
  `date` datetime DEFAULT NULL,
  `location` varchar(45) DEFAULT NULL,
  `basicallyIntactSquare` double DEFAULT NULL,
  `damagedSquare` double DEFAULT NULL,
  `destroyedSquare` double DEFAULT NULL,
  `note` varchar(45) DEFAULT NULL,
  `reportingUnit` varchar(20) DEFAULT NULL,
  `earthquakeId` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `house_disasterinfo`
--

LOCK TABLES `house_disasterinfo` WRITE;
/*!40000 ALTER TABLE `house_disasterinfo` DISABLE KEYS */;
INSERT INTO `house_disasterinfo` VALUES (1,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏土木','2021-04-23 00:00:57','北京东城区',10,3,2,'轻微','北京地震局','11010100100120210423000000'),(2,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏土木','2021-04-23 00:07:57','北京东城区',12,4,1,'轻微','北京地震局','11010100100120210423000000'),(3,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏土木','2021-04-23 00:05:50','北京东城区',22,2,1,'轻微','北京地震局','11010100100120210423000000'),(4,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏土木','2021-04-23 00:02:20','北京东城区',21,20,15,'严重','北京地震局','11010100100120210423000000'),(5,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏土木','2021-04-23 00:02:25','北京东城区',22,22,12,'严重','北京地震局','11010100100120210423000000'),(6,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏砖木','2021-04-23 00:00:57','北京东城区',15,5,3,'轻微','北京地震局','11010100100120210423000000'),(7,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏砖木','2021-04-23 00:02:57','北京东城区',20,3,3,'轻微','北京地震局','11010100100120210423000000'),(8,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏砖木','2021-04-23 00:12:57','北京东城区',10,23,43,'轻微','北京地震局','11010100100120210423000000'),(9,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏砖木','2021-04-23 00:32:57','北京东城区',12,27,23,'中等','北京地震局','11010100100120210423000000'),(10,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','房屋破坏砖木','2021-04-23 01:00:57','北京东城区',12,117,53,'严重','北京地震局','11010100100120210423000000');
/*!40000 ALTER TABLE `house_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `lifeline_disasterinfo`
--

DROP TABLE IF EXISTS `lifeline_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `lifeline_disasterinfo` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `province` varchar(45) NOT NULL,
  `city` varchar(45) NOT NULL,
  `country` varchar(45) NOT NULL,
  `town` varchar(45) NOT NULL,
  `village` varchar(45) NOT NULL,
  `category` varchar(45) NOT NULL,
  `date` datetime NOT NULL,
  `location` varchar(45) NOT NULL,
  `type` int NOT NULL,
  `grade` int NOT NULL,
  `picture` varchar(45) DEFAULT NULL,
  `note` varchar(45) DEFAULT NULL,
  `reportingUnit` varchar(45) DEFAULT NULL,
  `earthquakeId` varchar(45) NOT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lifeline_disasterinfo`
--

LOCK TABLES `lifeline_disasterinfo` WRITE;
/*!40000 ALTER TABLE `lifeline_disasterinfo` DISABLE KEYS */;
INSERT INTO `lifeline_disasterinfo` VALUES (1,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情交通','2021-04-23 19:44:10','北京东城区',3,2,'4115.png','轻微','北京地震局','11010100100120210423000000'),(2,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情交通','2021-04-23 19:44:20','北京东城区',2,3,'4116.png','轻微','北京地震局','11010100100120210423000000'),(3,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情交通','2021-04-23 19:44:20','北京东城区',2,4,'4117.png','轻微','北京地震局','11010100100120210423000000'),(4,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情交通','2021-04-23 19:44:30','北京东城区',1,3,'4118.png','轻微','北京地震局','11010100100120210423000000'),(5,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情交通','2021-04-23 19:44:40','北京东城区',2,4,'4119.png','轻微','北京地震局','11010100100120210423000000'),(6,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情供水','2021-04-23 19:44:57','北京东城区',1,1,'4125.png','轻微','北京地震局','11010100100120210423000000'),(7,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情供水','2021-04-23 19:41:10','北京东城区',1,2,'4126.png','轻微','北京地震局','11010100100120210423000000'),(8,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情供水','2021-04-23 19:40:20','北京东城区',1,3,'4127.png','轻微','北京地震局','11010100100120210423000000'),(9,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情供水','2021-04-23 19:40:30','北京东城区',1,4,'4128.png','轻微','北京地震局','11010100100120210423000000'),(10,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情供水','2021-04-23 19:40:40','北京东城区',1,3,'4129.png','轻微','北京地震局','11010100100120210423000000'),(11,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情输油','2021-04-23 19:45:57','北京东城区',4,3,'4135.png','轻微','北京地震局','11010100100120210423000000'),(12,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情输油','2021-04-23 19:41:10','北京东城区',3,1,'4136.png','轻微','北京地震局','11010100100120210423000000'),(13,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情输油','2021-04-23 19:41:20','北京东城区',3,2,'4137.png','轻微','北京地震局','11010100100120210423000000'),(14,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情输油','2021-04-23 19:41:30','北京东城区',3,3,'4138.png','轻微','北京地震局','11010100100120210423000000'),(15,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情输油','2021-04-23 19:41:40','北京东城区',3,4,'4139.png','轻微','北京地震局','11010100100120210423000000'),(16,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情燃气','2021-04-23 19:46:57','北京东城区',3,2,'4145.png','轻微','北京地震局','11010100100120210423000000'),(17,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情燃气','2021-04-23 19:46:10','北京东城区',3,1,'4146.png','轻微','北京地震局','11010100100120210423000000'),(18,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情燃气','2021-04-23 19:46:20','北京东城区',3,3,'4147.png','轻微','北京地震局','11010100100120210423000000'),(19,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情燃气','2021-04-23 19:46:30','北京东城区',2,1,'4148.png','轻微','北京地震局','11010100100120210423000000'),(20,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情燃气','2021-04-23 19:46:40','北京东城区',2,2,'4149.png','轻微','北京地震局','11010100100120210423000000'),(21,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情电力','2021-04-23 19:48:57','北京东城区',1,2,'4155.png','轻微','北京地震局','11010100100120210423000000'),(22,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情电力','2021-04-23 19:48:10','北京东城区',1,1,'4156.png','轻微','北京地震局','11010100100120210423000000'),(23,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情电力','2021-04-23 19:48:20','北京东城区',2,2,'4157.png','轻微','北京地震局','11010100100120210423000000'),(24,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情电力','2021-04-23 19:48:30','北京东城区',2,1,'4158.png','轻微','北京地震局','11010100100120210423000000'),(25,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情电力','2021-04-23 19:48:40','北京东城区',1,2,'4159.png','轻微','北京地震局','11010100100120210423000000'),(26,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情通信','2021-04-23 19:49:57','北京东城区',2,2,'4175.png','轻微','北京地震局','11010100100120210423000000'),(27,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情通信','2021-04-23 19:43:10','北京东城区',1,1,'4176.png','轻微','北京地震局','11010100100120210423000000'),(28,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情通信','2021-04-23 19:43:20','北京东城区',1,2,'4177.png','轻微','北京地震局','11010100100120210423000000'),(29,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情通信','2021-04-23 19:43:30','北京东城区',2,2,'4178.png','轻微','北京地震局','11010100100120210423000000'),(30,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情通信','2021-04-23 19:43:40','北京东城区',2,1,'4179.png','轻微','北京地震局','11010100100120210423000000'),(31,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情水利','2021-04-23 19:34:57','北京东城区',3,3,'4185.png','轻微','北京地震局','11010100100120210423000000'),(32,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情水利','2021-04-23 19:46:10','北京东城区',1,1,'4186.png','轻微','北京地震局','11010100100120210423000000'),(33,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情水利','2021-04-23 19:46:20','北京东城区',1,2,'4187.png','轻微','北京地震局','11010100100120210423000000'),(34,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情水利','2021-04-23 19:46:30','北京东城区',1,3,'4188.png','轻微','北京地震局','11010100100120210423000000'),(35,'北京市','市辖区','东城区','东华门街道办事处','东厂社区居委会','生命线工程灾情水利','2021-04-23 19:46:40','北京东城区',2,1,'4189.png','轻微','北京地震局','11010100100120210423000000');
/*!40000 ALTER TABLE `lifeline_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `people_disasterinfo`
--

DROP TABLE IF EXISTS `people_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `people_disasterinfo` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `province` varchar(45) NOT NULL,
  `city` varchar(45) NOT NULL,
  `country` varchar(45) NOT NULL,
  `town` varchar(45) NOT NULL,
  `village` varchar(45) NOT NULL,
  `category` varchar(45) NOT NULL,
  `date` datetime NOT NULL,
  `location` varchar(45) NOT NULL,
  `number` int NOT NULL,
  `reportingUnit` varchar(45) DEFAULT NULL,
  `earthquakeId` varchar(45) NOT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `people_disasterinfo`
--

LOCK TABLES `people_disasterinfo` WRITE;
/*!40000 ALTER TABLE `people_disasterinfo` DISABLE KEYS */;
INSERT INTO `people_disasterinfo` VALUES (1,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员死亡','2021-03-23 00:57:57','北京东城区',1,'北京地震局','11010100100120210423000000'),(2,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员死亡','2021-03-23 00:58:57','北京东城区',4,'北京地震局','11010100100120210423000000'),(3,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员死亡','2021-03-23 01:58:57','北京东城区',2,'北京地震局','11010100100120210423000000'),(4,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员死亡','2021-03-23 01:59:57','北京东城区',3,'北京地震局','11010100100120210423000000'),(5,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员死亡','2021-03-23 02:59:57','北京东城区',10,'北京地震局','11010100100120210423000000'),(6,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员受伤','2021-03-23 00:00:57','北京东城区',100,'北京地震局','11010100100120210423000000'),(7,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员受伤','2021-03-23 00:20:20','北京东城区',42,'北京地震局','11010100100120210423000000'),(8,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员受伤','2021-03-23 01:00:57','北京东城区',24,'北京地震局','11010100100120210423000000'),(9,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员受伤','2021-03-23 01:09:00','北京东城区',13,'北京地震局','11010100100120210423000000'),(10,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员受伤','2021-03-23 02:00:00','北京东城区',10,'北京地震局','11010100100120210423000000'),(11,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员失踪','2021-03-23 00:00:07','北京东城区',70,'北京地震局','11010100100120210423000000'),(12,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员失踪','2021-03-23 00:20:00','北京东城区',62,'北京地震局','11010100100120210423000000'),(13,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员失踪','2021-03-23 01:00:00','北京东城区',36,'北京地震局','11010100100120210423000000'),(14,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员失踪','2021-03-23 01:09:07','北京东城区',15,'北京地震局','11010100100120210423000000'),(15,'北京市','市辖区','东城区','东华门街道','多福巷社区居委会','人员失踪','2021-03-23 02:07:00','北京东城区',5,'北京地震局','11010100100120210423000000');
/*!40000 ALTER TABLE `people_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prediction_disasterinfo`
--

DROP TABLE IF EXISTS `prediction_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prediction_disasterinfo` (
  `id` int NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `grade` int NOT NULL,
  `intensity` int NOT NULL,
  `type` int NOT NULL,
  `picture` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prediction_disasterinfo`
--

LOCK TABLES `prediction_disasterinfo` WRITE;
/*!40000 ALTER TABLE `prediction_disasterinfo` DISABLE KEYS */;
INSERT INTO `prediction_disasterinfo` VALUES (1,'2021-04-23 00:00:00',2,4,2,'04231.png'),(2,'2021-04-23 00:00:20',3,6,2,'04232.png'),(3,'2021-04-23 00:01:20',4,6,2,'04233.png'),(4,'2021-04-23 00:01:22',2,4,2,'04234.png'),(5,'2021-04-23 00:01:25',6,6,2,'04234.png');
/*!40000 ALTER TABLE `prediction_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `second_disasterinfo`
--

DROP TABLE IF EXISTS `second_disasterinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `second_disasterinfo` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `province` varchar(45) DEFAULT NULL,
  `city` varchar(45) DEFAULT NULL,
  `country` varchar(45) DEFAULT NULL,
  `town` varchar(45) DEFAULT NULL,
  `village` varchar(45) DEFAULT NULL,
  `catagory` varchar(45) DEFAULT NULL,
  `date` datetime DEFAULT NULL,
  `location` varchar(45) DEFAULT NULL,
  `status` int DEFAULT NULL,
  `type` int DEFAULT NULL,
  `picture` varchar(45) DEFAULT NULL,
  `note` varchar(45) DEFAULT NULL,
  `reportingUnit` varchar(20) DEFAULT NULL,
  `earthquakeId` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `second_disasterinfo`
--

LOCK TABLES `second_disasterinfo` WRITE;
/*!40000 ALTER TABLE `second_disasterinfo` DISABLE KEYS */;
INSERT INTO `second_disasterinfo` VALUES (1,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害崩塌','2021-04-23 20:22:00','北京东城区',3,2,'41611.png','轻微','北京地震局','11010100100120210423000000'),(2,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害崩塌','2021-04-23 20:20:00','北京东城区',4,3,'41631.png','轻微','北京地震局','11010100100120210423000000'),(3,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害崩塌','2021-04-23 20:21:32','北京东城区',4,4,'41632.png','轻微','北京地震局','11010100100120210423000000'),(4,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害崩塌','2021-04-23 20:23:22','北京东城区',3,3,'41633.png','轻微','北京地震局','11010100100120210423000000'),(5,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害崩塌','2021-04-23 20:25:40','北京东城区',2,4,'41634.png','轻微','北京地震局','11010100100120210423000000'),(6,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害滑坡','2021-04-23 20:26:00','北京东城区',3,2,'41612.png','轻微','北京地震局','11010100100120210423000000'),(7,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害滑坡','2021-04-23 20:32:00','北京东城区',2,2,'41681.png','轻微','北京地震局','11010100100120210423000000'),(8,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害滑坡','2021-04-23 20:28:00','北京东城区',2,2,'41682.png','轻微','北京地震局','11010100100120210423000000'),(9,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害滑坡','2021-04-23 20:29:00','北京东城区',4,2,'41683.png','轻微','北京地震局','11010100100120210423000000'),(10,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害滑坡','2021-04-23 20:30:00','北京东城区',3,4,'41684.png','轻微','北京地震局','11010100100120210423000000'),(11,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害泥石流','2021-04-23 20:33:00','北京东城区',3,4,'41613.png','轻微','北京地震局','11010100100120210423000000'),(12,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害泥石流','2021-04-23 20:27:30','北京东城区',4,4,'41671.png','轻微','北京地震局','11010100100120210423000000'),(13,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害泥石流','2021-04-23 20:27:40','北京东城区',3,3,'41672.png','轻微','北京地震局','11010100100120210423000000'),(14,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害泥石流','2021-04-23 20:27:50','北京东城区',4,3,'41673.png','轻微','北京地震局','11010100100120210423000000'),(15,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害泥石流','2021-04-23 20:28:30','北京东城区',2,2,'41674.png','轻微','北京地震局','11010100100120210423000000'),(16,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害岩溶塌陷','2021-04-23 20:22:00','北京东城区',3,3,'41614.png','轻微','北京地震局','11010100100120210423000000'),(17,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害岩溶塌陷','2021-04-23 20:38:10','北京东城区',2,2,'41661.png','轻微','北京地震局','11010100100120210423000000'),(18,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害岩溶塌陷','2021-04-23 20:38:20','北京东城区',3,2,'41662.png','轻微','北京地震局','11010100100120210423000000'),(19,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害岩溶塌陷','2021-04-23 20:38:30','北京东城区',4,2,'41663.png','轻微','北京地震局','11010100100120210423000000'),(20,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害岩溶塌陷','2021-04-23 20:39:40','北京东城区',4,3,'41664.png','轻微','北京地震局','11010100100120210423000000'),(21,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地裂缝','2021-04-23 20:22:00','北京东城区',3,1,'41615.png','轻微','北京地震局','11010100100120210423000000'),(22,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地裂缝','2021-04-23 20:25:10','北京东城区',3,2,'41651.png','轻微','北京地震局','11010100100120210423000000'),(23,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地裂缝','2021-04-23 20:25:20','北京东城区',3,3,'41652.png','轻微','北京地震局','11010100100120210423000000'),(24,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地裂缝','2021-04-23 20:25:30','北京东城区',3,4,'41653.png','轻微','北京地震局','11010100100120210423000000'),(25,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地裂缝','2021-04-23 20:25:40','北京东城区',4,4,'41654.png','轻微','北京地震局','11010100100120210423000000'),(26,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地面沉降','2021-04-23 20:22:00','北京东城区',3,2,'41616.png','轻微','北京地震局','11010100100120210423000000'),(27,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地面沉降','2021-04-23 20:20:10','北京东城区',3,3,'41641.png','轻微','北京地震局','11010100100120210423000000'),(28,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地面沉降','2021-04-23 20:20:20','北京东城区',3,4,'41642.png','轻微','北京地震局','11010100100120210423000000'),(29,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地面沉降','2021-04-23 20:20:30','北京东城区',4,3,'41643.png','轻微','北京地震局','11010100100120210423000000'),(30,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害地面沉降','2021-04-23 20:20:40','北京东城区',4,4,'41644.png','轻微','北京地震局','11010100100120210423000000'),(31,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害其他','2021-04-23 20:22:00','北京东城区',3,3,'41617.png','轻微','北京地震局','11010100100120210423000000'),(32,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害其他','2021-04-23 20:19:10','北京东城区',4,3,'41691.png','轻微','北京地震局','11010100100120210423000000'),(33,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害其他','2021-04-23 20:19:20','北京东城区',3,4,'41692.png','轻微','北京地震局','11010100100120210423000000'),(34,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害其他','2021-04-23 20:19:30','北京东城区',3,2,'41693.png','轻微','北京地震局','11010100100120210423000000'),(35,'北京市','市辖区','东城区','东华门街道','多福巷社区委员会','次生灾害其他','2021-04-23 20:19:40','北京东城区',2,2,'41694.png','轻微','北京地震局','11010100100120210423000000');
/*!40000 ALTER TABLE `second_disasterinfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-06-06 11:11:09
